mobilinkd/stm32l452ceu6-demo/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_DAC1_Init(void);
static void MX_LPUART1_UART_Init(void);
static void MX_RNG_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM6_Init(void);
static void MX_CRC_Init(void);
static void MX_TIM2_Init(void);
void startDefaultTask(void const * argument);
extern void startIOEventTask(void const * argument);
extern void startCdcBlinker(void const * argument);
extern void startAudioInputTask(void const * argument);
extern void startModulatorTask(void const * argument);
extern void beacon(void const * argument);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void startADC(void);
float* filter(int16_t* input) __attribute__((section(".bss2")));

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
long _write_r(struct _reent *r, int fd, const char *ptr, int len);

long _write_r(struct _reent *r, int fd, const char *ptr, int len)
{
  for (int i = 0; i != len; ++i)
    ITM_SendChar(ptr[i]);
  return len;
}

inline void adc_buffer_copy(int n)
{
  ITM_SendChar('0' + adc_counter);
  uint16_t* dest = adc_bounce_buffer + (ADC_BUFFER_SIZE * adc_counter);
  uint16_t* src = ((uint16_t*)adc_buffer) + (n * ADC_BUFFER_SIZE);
  memcpy(dest, src, ADC_BUFFER_SIZE * 2);
  adc_counter = ((adc_counter + 1) & (ADC_BLOCKS - 1));
  osMessagePut(adcInputQueueHandle, (uint32_t) dest, 0);
}

// DMA Conversion first half complete.
void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef* unused)
{
  // ADC_STATUS_GPIO_Port->BRR = ADC_STATUS_Pin;
  ITM_SendChar('h');
  adc_buffer_copy(0);
}

// DMA Conversion second half complete.
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* unused)
{
  // ADC_STATUS_GPIO_Port->BSRR = ADC_STATUS_Pin;
  ITM_SendChar('c');
  adc_buffer_copy(1);
}

void startADC(void)
{
  HAL_StatusTypeDef adcStatus = HAL_ADCEx_Calibration_Start(&hadc1, ADC_SINGLE_ENDED);
  if (adcStatus != HAL_OK) {
    Error_Handler();
  }

  HAL_TIM_Base_Start(&htim6);
  HAL_ADC_Start_DMA(&hadc1, adc_buffer, ADC_BUFFER_SIZE * 2);
}

void init_filter(void)
{
  arm_fir_init_f32(&instance, FILTER_SIZE, (float32_t*)filter_taps,
    filter_state, ADC_BUFFER_SIZE);
}

float* filter(int16_t* input)
{
  // HAL_GPIO_WritePin(FIR_STATUS_GPIO_Port, FIR_STATUS_Pin, GPIO_PIN_SET);
  for (size_t i = 0; i != ADC_BUFFER_SIZE; i++) {
      filter_input[i] = (input[i] - 16384) * 0.000061035f;
  }
  arm_fir_f32(&instance, filter_input, filter_output, ADC_BUFFER_SIZE);
  // HAL_GPIO_WritePin(FIR_STATUS_GPIO_Port, FIR_STATUS_Pin, GPIO_PIN_RESET);
  return filter_output;

}

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_DAC1_Init();
  MX_LPUART1_UART_Init();
  MX_RNG_Init();
  MX_RTC_Init();
  MX_TIM6_Init();
  MX_CRC_Init();
  MX_TIM2_Init();

  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* Create the timer(s) */
  /* definition and creation of beaconTimer1 */
  osTimerDef(beaconTimer1, beacon);
  beaconTimer1Handle = osTimerCreate(osTimer(beaconTimer1), osTimerPeriodic, NULL);

  /* definition and creation of beaconTimer2 */
  osTimerDef(beaconTimer2, beacon);
  beaconTimer2Handle = osTimerCreate(osTimer(beaconTimer2), osTimerPeriodic, NULL);

  /* definition and creation of beaconTimer3 */
  osTimerDef(beaconTimer3, beacon);
  beaconTimer3Handle = osTimerCreate(osTimer(beaconTimer3), osTimerPeriodic, NULL);

  /* definition and creation of beaconTimer4 */
  osTimerDef(beaconTimer4, beacon);
  beaconTimer4Handle = osTimerCreate(osTimer(beaconTimer4), osTimerPeriodic, NULL);

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadStaticDef(defaultTask, startDefaultTask, osPriorityIdle, 0, 256, defaultTaskBuffer, &defaultTaskControlBlock);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* definition and creation of ioEventTask */
  osThreadStaticDef(ioEventTask, startIOEventTask, osPriorityLow, 0, 384, ioEventTaskBuffer, &ioEventTaskControlBlock);
  ioEventTaskHandle = osThreadCreate(osThread(ioEventTask), NULL);

  /* definition and creation of cdcBlinker */
  osThreadStaticDef(cdcBlinker, startCdcBlinker, osPriorityIdle, 0, 128, cdcBlinkerBuffer, &cdcBlinkerControlBlock);
  cdcBlinkerHandle = osThreadCreate(osThread(cdcBlinker), NULL);

  /* definition and creation of audioInputTask */
  osThreadStaticDef(audioInputTask, startAudioInputTask, osPriorityAboveNormal, 0, 512, audioInputTaskBuffer, &audioInputTaskControlBlock);
  audioInputTaskHandle = osThreadCreate(osThread(audioInputTask), NULL);

  /* definition and creation of modulatorTask */
  osThreadStaticDef(modulatorTask, startModulatorTask, osPriorityAboveNormal, 0, 384, modulatorTaskBuffer, &modulatorTaskControlBlock);
  modulatorTaskHandle = osThreadCreate(osThread(modulatorTask), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* Create the queue(s) */
  /* definition and creation of ioEventQueue */
  osMessageQStaticDef(ioEventQueue, 16, uint32_t, ioEventQueueBuffer, &ioEventQueueControlBlock);
  ioEventQueueHandle = osMessageCreate(osMessageQ(ioEventQueue), NULL);

